JamesHarman0020/ECE4191-Team-13-PSoC/DesignAttempt01.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "Pin_0.h"
#include "Pin_0_aliases.h"
#include "UART.h"
#include "UART_PVT.h"
#include "StepperDriver.h"
#include "Pin_1.h"
#include "Pin_1_aliases.h"
#include "Pin_2.h"
#include "Pin_2_aliases.h"
#include "Pin_3.h"
#include "Pin_3_aliases.h"
#include "I2C_1.h"
#include "I2C_1_I2C.h"
#include "I2C_1_PINS.h"
#include "I2C_1_I2C_PVT.h"
#include "I2C_1_PVT.h"
#include "I2C_1_BOOT.h"
#include "PWM.h"
#include "Clock_1.h"
#include "Pin_4.h"
#include "Pin_4_aliases.h"
#include "Pin_9.h"
#include "Pin_9_aliases.h"
#include "Pin_5.h"
#include "Pin_5_aliases.h"
#include "Pin_6.h"
#include "Pin_6_aliases.h"
#include "TB9051_EN.h"
#include "Pin_7.h"
#include "Pin_7_aliases.h"
#include "Pin_8.h"
#include "Pin_8_aliases.h"
#include "QuadPWM.h"
#include "Pin_10.h"
#include "Pin_10_aliases.h"
#include "UART_RPi.h"
#include "UART_RPi_SPI_UART.h"
#include "UART_RPi_PINS.h"
#include "UART_RPi_SPI_UART_PVT.h"
#include "UART_RPi_PVT.h"
#include "UART_RPi_BOOT.h"
#include "I2C_1_SCBCLK.h"
#include "I2C_1_sda.h"
#include "I2C_1_sda_aliases.h"
#include "I2C_1_scl.h"
#include "I2C_1_scl_aliases.h"
#include "I2C_1_SCB_IRQ.h"
#include "UART_RPi_SCBCLK.h"
#include "UART_RPi_tx.h"
#include "UART_RPi_tx_aliases.h"
#include "UART_RPi_SCB_IRQ.h"
#include "UART_RPi_rx.h"
#include "UART_RPi_rx_aliases.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyDMA.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

